astb_relise/src/Documents/МедицинскийОсмотр/МедицинскийОсмотр.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МедицинскийОсмотр</name>
  <registerRecords>InformationRegister.МедицинскиеОсмотрыСотрудников</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздательДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>МедицинскаяОрганизация</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМедосмотра</name>
    <type>
      <types>EnumRef.ВидыМедосмотров</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредседательМедицинскойКомиссии</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеНаМедицинскийОсмотр</name>
    <type>
      <types>DocumentRef.НаправлениеНаМедицинскийОсмотр</types>
    </type>
  </attributes>
  <attributes>
    <name>Противопоказания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВредныеИОпасныеПроизводственныеФакторы</name>
    <attributes>
      <name>Фактор</name>
      <type>
        <types>CatalogRef.ВредныеИОпасныеПроизводственныеФакторы</types>
      </type>
    </attributes>
    <attributes>
      <name>Противопоказания</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВредныеИОпасныеПроизводственныеРаботы</name>
    <attributes>
      <name>Работа</name>
      <type>
        <types>CatalogRef.ВредныеИОпасныеПроизводственныеРаботы</types>
      </type>
    </attributes>
    <attributes>
      <name>Противопоказания</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

astb_relise/src/AccumulationRegisters/ЗанятыеРабочиеМеста/ЗанятыеРабочиеМеста.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗанятыеРабочиеМеста</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиИПрофессии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаАСТБ</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

astb_relise/src/InformationRegisters/ВредныеИОпасныеФакторыИРаботыНаРабочихМестах/ВредныеИОпасныеФакторыИРаботыНаРабочихМестах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВредныеИОпасныеФакторыИРаботыНаРабочихМестах</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ФакторРабота</name>
    <type>
      <types>CatalogRef.ВредныеИОпасныеПроизводственныеФакторы</types>
      <types>CatalogRef.ВредныеИОпасныеПроизводственныеРаботы</types>
    </type>
  </resources>
  <resources>
    <name>Значение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиИПрофессии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаАСТБ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФакторИлиРабота</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СлужебноеИзмерение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

astb_relise/src/Documents/МедицинскийОсмотр/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МедицинскийОсмотрВредныеИОпасныеПроизводственныеФакторы.Ссылка.Дата КАК Период,
	|	МедицинскийОсмотрВредныеИОпасныеПроизводственныеФакторы.Ссылка.Организация КАК Организация,
	|	МедицинскийОсмотрВредныеИОпасныеПроизводственныеФакторы.Ссылка.Сотрудник КАК Сотрудник,
	|	МедицинскийОсмотрВредныеИОпасныеПроизводственныеФакторы.Ссылка.МедицинскаяОрганизация КАК МедицинскаяОрганизация,
	|	МедицинскийОсмотрВредныеИОпасныеПроизводственныеФакторы.Ссылка.ВидМедосмотра КАК ВидМедосмотра,
	|	МедицинскийОсмотрВредныеИОпасныеПроизводственныеФакторы.Ссылка.НаправлениеНаМедицинскийОсмотр КАК Направление,
	|	МедицинскийОсмотрВредныеИОпасныеПроизводственныеФакторы.Фактор КАК ФакторРабота,
	|	МедицинскийОсмотрВредныеИОпасныеПроизводственныеФакторы.Противопоказания КАК Противопоказания
	|ИЗ
	|	Документ.МедицинскийОсмотр.ВредныеИОпасныеПроизводственныеФакторы КАК МедицинскийОсмотрВредныеИОпасныеПроизводственныеФакторы
	|ГДЕ
	|	МедицинскийОсмотрВредныеИОпасныеПроизводственныеФакторы.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МедицинскийОсмотрВредныеИОпасныеПроизводственныеРаботы.Ссылка.Дата,
	|	МедицинскийОсмотрВредныеИОпасныеПроизводственныеРаботы.Ссылка.Организация,
	|	МедицинскийОсмотрВредныеИОпасныеПроизводственныеРаботы.Ссылка.Сотрудник,
	|	МедицинскийОсмотрВредныеИОпасныеПроизводственныеРаботы.Ссылка.МедицинскаяОрганизация,
	|	МедицинскийОсмотрВредныеИОпасныеПроизводственныеРаботы.Ссылка.ВидМедосмотра,
	|	МедицинскийОсмотрВредныеИОпасныеПроизводственныеРаботы.Ссылка.НаправлениеНаМедицинскийОсмотр,
	|	МедицинскийОсмотрВредныеИОпасныеПроизводственныеРаботы.Работа,
	|	МедицинскийОсмотрВредныеИОпасныеПроизводственныеРаботы.Противопоказания
	|ИЗ
	|	Документ.МедицинскийОсмотр.ВредныеИОпасныеПроизводственныеРаботы КАК МедицинскийОсмотрВредныеИОпасныеПроизводственныеРаботы
	|ГДЕ
	|	МедицинскийОсмотрВредныеИОпасныеПроизводственныеРаботы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МедицинскийОсмотр.Дата КАК Период,
	|	МедицинскийОсмотр.Организация КАК Организация,
	|	МедицинскийОсмотр.Сотрудник КАК Сотрудник,
	|	МедицинскийОсмотр.МедицинскаяОрганизация КАК МедицинскаяОрганизация,
	|	МедицинскийОсмотр.ВидМедосмотра КАК ВидМедосмотра,
	|	МедицинскийОсмотр.НаправлениеНаМедицинскийОсмотр КАК НаправлениеНаМедицинскийОсмотр,
	|	ЗНАЧЕНИЕ(Справочник.ВредныеИОпасныеПроизводственныеФакторы.ПустаяСсылка) КАК ФакторРабота,
	|	МедицинскийОсмотр.Противопоказания КАК Противопоказания
	|ИЗ
	|	Документ.МедицинскийОсмотр КАК МедицинскийОсмотр
	|ГДЕ
	|	МедицинскийОсмотр.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	
	Результат = Запрос.ВыполнитьПакет();
	ФакторыИРаботы = Результат[0].Выгрузить();
	Если ФакторыИРаботы.Количество() = 0 Тогда
		ТаблицыДляДвижений.Вставить("ТаблицаМедицинскиеОсмотрыСотрудников", Результат[1].Выгрузить());
	Иначе
		ТаблицыДляДвижений.Вставить("ТаблицаМедицинскиеОсмотрыСотрудников", ФакторыИРаботы);
	КонецЕсли;	
	
КонецПроцедуры	

Процедура ЗаполнитьТаблицыДокумента(ТекущийОбъект) Экспорт
	
	ДатаАнализа = ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ТекущийОбъект.Ссылка);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВредныеИОпасныеФакторыИРаботыНаРабочихМестахСрезПоследних.ФакторИлиРабота КАК ФакторИлиРабота,
	|	ВредныеИОпасныеФакторыИРаботыНаРабочихМестахСрезПоследних.ФакторРабота КАК ФакторРабота
	|ПОМЕСТИТЬ ВТ_Результат
	|ИЗ
	|	РегистрНакопления.ЗанятыеРабочиеМеста.Остатки(
	|			&ДатаАнализа,
	|			Организация = &Организация
	|				И Сотрудник = &Сотрудник) КАК ЗанятыеРабочиеМестаОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВредныеИОпасныеФакторыИРаботыНаРабочихМестах.СрезПоследних(&ДатаАнализа, Организация = &Организация) КАК ВредныеИОпасныеФакторыИРаботыНаРабочихМестахСрезПоследних
	|		ПО (ВредныеИОпасныеФакторыИРаботыНаРабочихМестахСрезПоследних.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|				ИЛИ ЗанятыеРабочиеМестаОстатки.Подразделение = ВредныеИОпасныеФакторыИРаботыНаРабочихМестахСрезПоследних.Подразделение)
	|			И (ВредныеИОпасныеФакторыИРаботыНаРабочихМестахСрезПоследних.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|				ИЛИ ЗанятыеРабочиеМестаОстатки.Должность = ВредныеИОпасныеФакторыИРаботыНаРабочихМестахСрезПоследних.Должность)
	|			И (ВредныеИОпасныеФакторыИРаботыНаРабочихМестахСрезПоследних.РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМестаАСТБ.ПустаяСсылка)
	|				ИЛИ ЗанятыеРабочиеМестаОстатки.РабочееМесто = ВредныеИОпасныеФакторыИРаботыНаРабочихМестахСрезПоследних.РабочееМесто)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Результат.ФакторРабота КАК Фактор
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|ГДЕ
	|	ВТ_Результат.ФакторИлиРабота = ""Ф""
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Результат.ФакторРабота.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Результат.ФакторРабота КАК Работа
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|ГДЕ
	|	ВТ_Результат.ФакторИлиРабота = ""Р""
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Результат.ФакторРабота.Наименование";	
	
	Запрос.УстановитьПараметр("ДатаАнализа",ДатаАнализа);
	Запрос.УстановитьПараметр("Организация",ТекущийОбъект.Организация);
	Запрос.УстановитьПараметр("Сотрудник",	ТекущийОбъект.Сотрудник);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТекущийОбъект.ВредныеИОпасныеПроизводственныеФакторы.Очистить();
	ТекущийОбъект.ВредныеИОпасныеПроизводственныеРаботы.Очистить();
	
	ТекущийОбъект.ВредныеИОпасныеПроизводственныеФакторы.Загрузить(Результат[1].Выгрузить());
	ТекущийОбъект.ВредныеИОпасныеПроизводственныеРаботы.Загрузить(Результат[2].Выгрузить());
	
КонецПроцедуры	
	
#КонецЕсли
